IDEA Open Model
NadSetupValueBool Class
Compatible with IDEA StatiCa 20.1
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueBool
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class NadSetupValueBool : NadSetupValue
Public Class NadSetupValueBool
	Inherits NadSetupValue
The NadSetupValueBool type exposes the following members.
Constructors
Name | Description
NadSetupValueBool
Initializes a new instance of the NadSetupValueBool class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from NadSetupValue.)
IsActive
 Is active
 (Inherited from NadSetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace